Revit 2015 API
TextNoteTypeSet.Insert Method
Insert the specified textnote type into the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
public virtual bool Insert(
	TextNoteType item
)
Visual Basic
Public Overridable Function Insert ( _
	item As TextNoteType _
) As Boolean
Visual C++
public:
virtual bool Insert(
	TextNoteType^ item
)
Parameters
item
Type: Autodesk.Revit.DB.TextNoteType
The textnote type to be inserted into the set.
Return Value
Returns whether the textnote type was inserted into the set.
See Also
TextNoteTypeSet Class
Autodesk.Revit.DB Namespace